Revit 2027 API
EdgeArray.Append Method
Add the edge to the end of the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Append(
	Edge item
)
Public Overridable Sub Append (
	item As Edge
)
public:
virtual void Append(
	Edge^ item
)
abstract Append :
        item : Edge -> unit
override Append :
        item : Edge -> unit
Parameters
item Edge
The edge to be added.
See Also
Reference
EdgeArray Class
Autodesk.Revit.DB Namespace